
/*
Таск <номер таска>
1. Определить входные данные, выходные данные, их тип
2. Придумать интерфейс
3. Реализовать ввод данных
4. Решить задачу на листочке - получить формулы (пройтись по задачам и проговорить идеи)
5. Перенести формулу(ы) в код
6. Реализовать вывод результата
7. Вынести расчёт в функцию
8. Рефакторинг
 */

import java.util.Locale;
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Locale.setDefault(Locale.ROOT);

        Scanner scanner = new Scanner(System.in);

        System.out.println("Hello World!");
    }
}